In [1]:
import pandas as pd

In [17]:
city = ["KMT","BZA","PRYG","WL","REGULACHALA","KMT","BZA"]
Rank = [9,3.4,1.5,4,10,2.2,1]
person = ["Raghu","chinni","Bittu","Guna","Raghuram","Raghu","Ram"]
fd = {"City" : city,"Rank" : Rank , "Person" : person}
fd = pd.DataFrame(fd)

In [18]:
fd

          City  Rank    Person
0          KMT   9.0     Raghu
1          BZA   3.4    chinni
2         PRYG   1.5     Bittu
3           WL   4.0      Guna
4  REGULACHALA  10.0  Raghuram
5          KMT   2.2     Raghu
6          BZA   1.0       Ram

In [24]:
fd.duplicated(["City","Person"]).sum()

1

In [16]:
fd.drop_duplicates("City" , keep = 'first')

          City  Rank    Person
0          KMT   9.0     Raghu
1          BZA   3.4    chinni
2         PRYG   1.5     Bittu
3           WL   4.0      Guna
4  REGULACHALA  10.0  Raghuram

In [25]:
fd.drop_duplicates("City",keep = "last")

          City  Rank    Person
2         PRYG   1.5     Bittu
3           WL   4.0      Guna
4  REGULACHALA  10.0  Raghuram
5          KMT   2.2     Raghu
6          BZA   1.0       Ram

In [27]:
fd.drop_duplicates("City",keep = False)

          City  Rank    Person
2         PRYG   1.5     Bittu
3           WL   4.0      Guna
4  REGULACHALA  10.0  Raghuram

In [28]:
fd.drop_duplicates(["City","Person"] , keep = 'first')

          City  Rank    Person
0          KMT   9.0     Raghu
1          BZA   3.4    chinni
2         PRYG   1.5     Bittu
3           WL   4.0      Guna
4  REGULACHALA  10.0  Raghuram
6          BZA   1.0       Ram